
## Plan Result

[CI link](https://github.com/NaokiYazawa/bined-infra/actions/runs/5707283712)


<pre><code>Plan: 2 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.alb.aws_lb_listener_rule.main
  * module.ecs.aws_ecs_service.ecs_service


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.alb.aws_lb_listener_rule.main will be created
  + resource "aws_lb_listener_rule" "main" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = "arn:aws:elasticloadbalancing:ap-northeast-1:761817748648:listener/app/bined-hasura/a741a29df068794d/1648e0df2c74c4a2"
      + priority     = 100
      + tags_all     = (known after apply)

      + action {
          + order            = (known after apply)
          + target_group_arn = "arn:aws:elasticloadbalancing:ap-northeast-1:761817748648:targetgroup/bined-hasura-alb-target-group/dd6db5e43b282fe2"
          + type             = "forward"
        }

      + condition {
          + path_pattern {
              + values = [
                  + "/*",
                ]
            }
        }
    }

  # module.ecs.aws_ecs_service.ecs_service will be created
  + resource "aws_ecs_service" "ecs_service" {
      + cluster                            = "arn:aws:ecs:ap-northeast-1:761817748648:cluster/bined-hasura"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "bined-hasura"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = (known after apply)
      + task_definition                    = "arn:aws:ecs:ap-northeast-1:761817748648:task-definition/bined-hasura:1"
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "bined-hasura"
          + container_port   = 8080
          + target_group_arn = "arn:aws:elasticloadbalancing:ap-northeast-1:761817748648:targetgroup/bined-hasura-alb-target-group/dd6db5e43b282fe2"
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = [
              + "sg-0ff51e5c4d89f1d35",
            ]
          + subnets          = [
              + "subnet-04e257e755c87b631",
              + "subnet-0f0bc25f4fe692b9f",
            ]
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"terraform","PRNumber":13,"Program":"tfcmt","SHA1":"4afc7f957d7495c94353dca75a1b545dd3a937fa","Vars":{},"WorkflowName":"Terraform"} -->